authenticate_me/backend/authenticate-me/app/models/user.rb

  def self.find_by_credentials(credentials, password)
    if credentials =~ URI::MailTo::EMAIL_REGEXP
      user = User.find_by(email: credentials)
    else
      user = User.find_by(username: credentials)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Demo-lition"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT $1  [["LIMIT", 1]]